alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4800.svd
				<register>
					<name>SDRMOD</name>
					<description>EBU SDRAM Mode Register</description>
					<addressOffset>0x6C</addressOffset>
					<size>32</size>
					<resetValue>0x00000020</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XBA</name>
							<description>Extended Operation Bank Select</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>XOPM</name>
							<description>Extended Operation Mode</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>COLDSTART</name>
							<description>SDRAM coldstart</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OPMODE</name>
							<description>Operation Mode</description>
							<lsb>7</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Only this value must be written (default after reset)</description>
									<value>#000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CASLAT</name>
							<description>CAS latency</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Two clocks (default after reset)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Three clocks</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BTYP</name>
							<description>Burst type</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Only this value should be written (default after reset)</description>
									<value>#0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BURSTL</name>
							<description>Burst length</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 (default after reset)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SDRMREF</name>
					<description>EBU SDRAM Refresh Control Register</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RES_DLY</name>
							<description>Delay on Power Down Exit</description>
							<lsb>25</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ARFSH</name>
							<description>Auto Refresh on Self refresh Exit</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SELFREX_DLY</name>
							<description>Self Refresh Exit Delay</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ERFSHC</name>
							<description>Extended Refresh Counter Period</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AUTOSELFR</name>
							<description>Automatic Self Refresh</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SELFREN</name>
							<description>Self Refresh Entry</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SELFRENST</name>
							<description>Self Refresh Entry Status.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SELFREX</name>
							<description>Self Refresh Exit (Power Up).</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SELFREXST</name>
							<description>Self Refresh Exit Status.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>REFRESHR</name>
							<description>Number of refresh commands</description>
							<lsb>6</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REFRESHC</name>
							<description>Refresh counter period</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SDRSTAT</name>
					<description>EBU SDRAM Status Register</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<resetValue>0x00010000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SDERR</name>
							<description>SDRAM read error</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Reads running successfully</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Read error condition has been detected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SDRMBUSY</name>
							<description>SDRAM Busy</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Power-up initialization sequence is not running</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Power-up initialization sequence is running</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REFERR</name>
							<description>SDRAM Refresh Error</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No refresh error.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Refresh error occurred.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
