alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4800.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="ECAT0_FMMU0">
			<name>ECAT0_FMMU1</name>
			<description>EtherCAT 0</description>
			<groupName>ECAT</groupName>
			<baseAddress>0x54010610</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x10</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="ECAT0_FMMU0">
			<name>ECAT0_FMMU2</name>
			<description>EtherCAT 0</description>
			<groupName>ECAT</groupName>
			<baseAddress>0x54010620</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x10</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="ECAT0_FMMU0">
			<name>ECAT0_FMMU3</name>
			<description>EtherCAT 0</description>
			<groupName>ECAT</groupName>
			<baseAddress>0x54010630</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x10</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="ECAT0_FMMU0">
			<name>ECAT0_FMMU4</name>
			<description>EtherCAT 0</description>
			<groupName>ECAT</groupName>
			<baseAddress>0x54010640</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x10</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="ECAT0_FMMU0">
			<name>ECAT0_FMMU5</name>
			<description>EtherCAT 0</description>
			<groupName>ECAT</groupName>
			<baseAddress>0x54010650</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x10</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="ECAT0_FMMU0">
			<name>ECAT0_FMMU6</name>
			<description>EtherCAT 0</description>
			<groupName>ECAT</groupName>
			<baseAddress>0x54010660</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x10</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="ECAT0_FMMU0">
			<name>ECAT0_FMMU7</name>
			<description>EtherCAT 0</description>
			<groupName>ECAT</groupName>
			<baseAddress>0x54010670</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x10</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>ECAT0_SM0</name>
			<description>EtherCAT 0</description>
			<groupName>ECAT</groupName>
			<headerStructName>ECAT0_SM</headerStructName>
			<baseAddress>0x54010800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x08</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>SM_P_START_ADR</name>
					<description>Physical Start Address SyncManager 0</description>
					<addressOffset>0x00</addressOffset>
					<size>16</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>FIRST_BYTE</name>
							<description>Specifies first byte that will be handled by SyncManager</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SM_LEN</name>
					<description>Length SyncManager 0</description>
					<addressOffset>0x02</addressOffset>
					<size>16</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>NO_BYTES</name>
							<description>Number of bytes assigned to SyncManager</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SM_CONTROL</name>
					<description>Control Register SyncManager 0</description>
					<addressOffset>0x04</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>OP_MODE</name>
							<description>Operation Mode</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Buffered (3 buffer mode)</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Mailbox (Single buffer mode)</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIR</name>
							<description>Direction</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Read: ECAT read access, PDI write access</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Write: ECAT write access, PDI read access</description>
									<value>0b01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT_ECAT</name>
							<description>Interrupt in ECAT Event Request Register</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT_PDI</name>
							<description>Interrupt in PDI Event Request Register</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_TRG</name>
							<description>Watchdog Trigger Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SM_STATUS</name>
					<description>Status Register SyncManager 0</description>
					<addressOffset>0x05</addressOffset>
					<size>8</size>
					<resetValue>0x30</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>INT_W</name>
							<description>Interrupt Write</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt cleared after first byte of buffer was read</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt after buffer was completely and successfully written</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT_R</name>
							<description>Interrupt Read</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt cleared after first byte of buffer was written</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt after buffer was completely and successful read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MB_STATUS</name>
							<description>Mailbox mode: mailbox status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Mailbox empty</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Mailbox full</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUF_STATUS</name>
							<description>Buffered mode: buffer status (last written buffer)</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1. buffer</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2. buffer</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>3. buffer</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>(no buffer written)</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>R_BUF_IU</name>
							<description>Read buffer in use (opened)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>buffer not in use</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>buffer in use</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>W_BUF_IU</name>
							<description>Write buffer in use (opened)</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>buffer not in use</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>buffer in use</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SM_ACT</name>
					<description>Activate SyncManager 0</description>
					<addressOffset>0x06</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>SM_EN</name>
							<description>SyncManager Enable/Disable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Disable: Access to Memory without SyncManager control</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Enable: SyncManager is active and controls Memory area set in configuration</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REP_REQ</name>
							<description>Repeat Request</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LE_ECAT</name>
							<description>LatchEvent ECAT</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Generate Latch event if EtherCAT master issues a buffer exchange</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LE_PDI</name>
							<description>LatchEvent PDI</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Generate Latch events if PDI issues a buffer exchange or if PDI accesses buffer start address</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SM_PDI_CTR</name>
					<description>PDI Control SyncManager 0</description>
					<addressOffset>0x07</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>DEACT</name>
							<description>Deactivate SyncManager</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Read 0 for Normal operation, SyncManager activated, write 0 for Activate SyncManager</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Read 1 for SyncManager deactivated and reset SyncManager locks access to Memory area, write 1 for Request SyncManager deactivation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REP_ACK</name>
							<description>Repeat Ack</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
