alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4800.svd
				<register>
					<name>GUSBCFG</name>
					<description>USB Configuration Register</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<resetValue>0x00001440</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TOutCal</name>
							<description>FS Timeout Calibration</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PHYSel</name>
							<description>USB 1.1 Full-Speed Serial Transceiver Select</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value2</name>
									<description>USB 1.1 full-speed serial transceiver</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRPCap</name>
							<description>SRP-Capable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>SRP capability is not enabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>SRP capability is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HNPCap</name>
							<description>HNP-Capable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>HNP capability is not enabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>HNP capability is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USBTrdTim</name>
							<description>USB Turnaround Time</description>
							<lsb>10</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OtgI2CSel</name>
							<description>UTMIFS Interface Select</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>UTMI USB 1.1 Full-Speed interface for OTG signals</description>
									<value>#0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TxEndDelay</name>
							<description>Tx End Delay</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Normal mode</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Introduce Tx end delay timers</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ForceHstMode</name>
							<description>Force Host Mode</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Normal Mode</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Force Host Mode</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ForceDevMode</name>
							<description>Force Device Mode</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Normal Mode</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Force Device Mode</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTP</name>
							<description>Corrupt Tx packet</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GRSTCTL</name>
					<description>Reset Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<resetValue>0x10000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CSftRst</name>
							<description>Core Soft Reset</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FrmCntrRst</name>
							<description>Host Frame Counter Reset</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RxFFlsh</name>
							<description>RxFIFO Flush</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TxFFlsh</name>
							<description>TxFIFO Flush</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TxFNum</name>
							<description>TxFIFO Number</description>
							<lsb>6</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Non-periodic TxFIFO flush in Host mode or Tx FIFO 0 flush in device mode</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Periodic TxFIFO flush in Host mode or Tx FIFO 1 flush in device mode</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Tx FIFO 2 flush in device mode</description>
									<value>0x02</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Tx FIFO 15 flush in device mode</description>
									<value>0x0F</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Flush all the transmit FIFOs in device or host mode.</description>
									<value>0x10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMAReq</name>
							<description>DMA Request Signal</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AHBIdle</name>
							<description>AHB Master Idle</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GINTSTS_HOSTMODE</name>
					<description>Interrupt Register [HOSTMODE]</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<resetValue>0x14000020</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CurMod</name>
							<description>Current Mode of Operation</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Device mode</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Host mode</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ModeMis</name>
							<description>Mode Mismatch Interrupt</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OTGInt</name>
							<description>OTG Interrupt</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>Sof</name>
							<description>Start of Frame</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RxFLvl</name>
							<description>RxFIFO Non-Empty</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>incomplP</name>
							<description>Incomplete Periodic Transfer</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PrtInt</name>
							<description>Host Port Interrupt</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HChInt</name>
							<description>Host Channels Interrupt</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PTxFEmp</name>
							<description>Periodic TxFIFO Empty</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ConIDStsChng</name>
							<description>Connector ID Status Change</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DisconnInt</name>
							<description>Disconnect Detected Interrupt</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SessReqInt</name>
							<description>Session Request/New Session Detected Interrupt</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WkUpInt</name>
							<description>Resume/Remote Wakeup Detected Interrupt</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GINTSTS_DEVICEMODE</name>
					<description>Interrupt Register [DEVICEMODE]</description>
					<alternateRegister>GINTSTS_HOSTMODE</alternateRegister>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<resetValue>0x14000020</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CurMod</name>
							<description>Current Mode of Operation</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Device mode</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Host mode</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ModeMis</name>
							<description>Mode Mismatch Interrupt</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OTGInt</name>
							<description>OTG Interrupt</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>Sof</name>
							<description>Start of Frame</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RxFLvl</name>
							<description>RxFIFO Non-Empty</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>GINNakEff</name>
							<description>Global IN Non-Periodic NAK Effective</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>GOUTNakEff</name>
							<description>Global OUT NAK Effective</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ErlySusp</name>
							<description>Early Suspend</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USBSusp</name>
							<description>USB Suspend</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USBRst</name>
							<description>USB Reset</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EnumDone</name>
							<description>Enumeration Done</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ISOOutDrop</name>
							<description>Isochronous OUT Packet Dropped Interrupt</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EOPF</name>
							<description>End of Periodic Frame Interrupt</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IEPInt</name>
							<description>IN Endpoints Interrupt</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OEPInt</name>
							<description>OUT Endpoints Interrupt</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>incompISOIN</name>
							<description>Incomplete Isochronous IN Transfer</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>incomplSOOUT</name>
							<description>Incomplete Isochronous OUT Transfer</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ConIDStsChng</name>
							<description>Connector ID Status Change</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SessReqInt</name>
							<description>Session Request/New Session Detected Interrupt</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WkUpInt</name>
							<description>Resume/Remote Wakeup Detected Interrupt</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GINTMSK_HOSTMODE</name>
					<description>Interrupt Mask Register [HOSTMODE]</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ModeMisMsk</name>
							<description>Mode Mismatch Interrupt Mask</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OTGIntMsk</name>
							<description>OTG Interrupt Mask</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SofMsk</name>
							<description>Start of Frame Mask</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RxFLvlMsk</name>
							<description>Receive FIFO Non-Empty Mask</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>incomplPMsk</name>
							<description>Incomplete Periodic Transfer Mask</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PrtIntMsk</name>
							<description>Host Port Interrupt Mask</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HChIntMsk</name>
							<description>Host Channels Interrupt Mask</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PTxFEmpMsk</name>
							<description>Periodic TxFIFO Empty Mask</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ConIDStsChngMsk</name>
							<description>Connector ID Status Change Mask</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DisconnIntMsk</name>
							<description>Disconnect Detected Interrupt Mask</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SessReqIntMsk</name>
							<description>Session Request/New Session Detected Interrupt Mask</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WkUpIntMsk</name>
							<description>Resume/Remote Wakeup Detected Interrupt Mask</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GINTMSK_DEVICEMODE</name>
					<description>Interrupt Mask Register [DEVICEMODE]</description>
					<alternateRegister>GINTMSK_HOSTMODE</alternateRegister>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ModeMisMsk</name>
							<description>Mode Mismatch Interrupt Mask</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OTGIntMsk</name>
							<description>OTG Interrupt Mask</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SofMsk</name>
							<description>Start of Frame Mask</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RxFLvlMsk</name>
							<description>Receive FIFO Non-Empty Mask</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GINNakEffMsk</name>
							<description>Global Non-periodic IN NAK Effective Mask</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GOUTNakEffMsk</name>
							<description>Global OUT NAK Effective Mask</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ErlySuspMsk</name>
							<description>Early Suspend Mask</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USBSuspMsk</name>
							<description>USB Suspend Mask</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USBRstMsk</name>
							<description>USB Reset Mask</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EnumDoneMsk</name>
							<description>Enumeration Done Mask</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ISOOutDropMsk</name>
							<description>Isochronous OUT Packet Dropped Interrupt Mask</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EOPFMsk</name>
							<description>End of Periodic Frame Interrupt Mask</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IEPIntMsk</name>
							<description>IN Endpoints Interrupt Mask</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OEPIntMsk</name>
							<description>OUT Endpoints Interrupt Mask</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>incompISOINMsk</name>
							<description>Incomplete Isochronous IN Transfer Mask</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>incomplSOOUTMsk</name>
							<description>Incomplete Isochronous OUT Transfer Mask</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ConIDStsChngMsk</name>
							<description>Connector ID Status Change Mask</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DisconnIntMsk</name>
							<description>Disconnect Detected Interrupt Mask</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SessReqIntMsk</name>
							<description>Session Request/New Session Detected Interrupt Mask</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WkUpIntMsk</name>
							<description>Resume/Remote Wakeup Detected Interrupt Mask</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
