alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4800.svd
				<register>
					<name>DSTS</name>
					<description>Device Status Register</description>
					<addressOffset>0x808</addressOffset>
					<size>32</size>
					<resetValue>0x00000002</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SuspSts</name>
							<description>Suspend Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EnumSpd</name>
							<description>Enumerated Speed</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value4</name>
									<description>Full speed (PHY clock is running at 48 MHz)</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ErrticErr</name>
							<description>Erratic Error</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SOFFN</name>
							<description>Frame Number of the Received SOF</description>
							<lsb>8</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPMSK</name>
					<description>Device IN Endpoint Common Interrupt Mask Register</description>
					<addressOffset>0x810</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XferComplMsk</name>
							<description>Transfer Completed Interrupt Mask</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EPDisbldMsk</name>
							<description>Endpoint Disabled Interrupt Mask</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AHBErrMsk</name>
							<description>AHB Error Mask</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TimeOUTMsk</name>
							<description>Timeout Condition Mask</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INTknTXFEmpMsk</name>
							<description>IN Token Received When TxFIFO Empty Mask</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPNakEffMsk</name>
							<description>IN Endpoint NAK Effective Mask</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TxfifoUndrnMsk</name>
							<description>Fifo Underrun Mask</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BNAInIntrMsk</name>
							<description>BNA Interrupt Mask</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NAKMsk</name>
							<description>NAK interrupt Mask</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DOEPMSK</name>
					<description>Device OUT Endpoint Common Interrupt Mask Register</description>
					<addressOffset>0x814</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XferComplMsk</name>
							<description>Transfer Completed Interrupt Mask</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EPDisbldMsk</name>
							<description>Endpoint Disabled Interrupt Mask</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AHBErrMsk</name>
							<description>AHB Error</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SetUPMsk</name>
							<description>SETUP Phase Done Mask</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OUTTknEPdisMsk</name>
							<description>OUT Token Received when Endpoint Disabled Mask</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Back2BackSETup</name>
							<description>Back-to-Back SETUP Packets Received Mask</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OutPktErrMsk</name>
							<description>OUT Packet Error Mask</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BnaOutIntrMsk</name>
							<description>BNA interrupt Mask</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BbleErrMsk</name>
							<description>Babble Interrupt Mask</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NAKMsk</name>
							<description>NAK Interrupt Mask</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NYETMsk</name>
							<description>NYET Interrupt Mask</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DAINT</name>
					<description>Device All Endpoints Interrupt Register</description>
					<addressOffset>0x818</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>InEpInt</name>
							<description>IN Endpoint Interrupt Bits</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OutEPInt</name>
							<description>OUT Endpoint Interrupt Bits</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DAINTMSK</name>
					<description>Device All Endpoints Interrupt Mask Register</description>
					<addressOffset>0x81C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>InEpMsk</name>
							<description>IN EP Interrupt Mask Bits</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OutEpMsk</name>
							<description>OUT EP Interrupt Mask Bits</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DVBUSDIS</name>
					<description>Device VBUS Discharge Time Register</description>
					<addressOffset>0x828</addressOffset>
					<size>32</size>
					<resetValue>0x000017D7</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DVBUSDis</name>
							<description>Device Vbus Discharge Time</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DVBUSPULSE</name>
					<description>Device VBUS Pulsing Time Register</description>
					<addressOffset>0x82C</addressOffset>
					<size>32</size>
					<resetValue>0x000005B8</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DVBUSPulse</name>
							<description>Device Vbus Pulsing Time</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPEMPMSK</name>
					<description>Device IN Endpoint FIFO Empty Interrupt Mask Register</description>
					<addressOffset>0x834</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>InEpTxfEmpMsk</name>
							<description>IN EP Tx FIFO Empty Interrupt Mask Bits</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PCGCCTL</name>
					<description>Power and Clock Gating Control Register</description>
					<addressOffset>0xE00</addressOffset>
					<size>32</size>
					<resetValue>0x00000100</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>StopPclk</name>
							<description>Stop Pclk</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GateHclk</name>
							<description>Gate Hclk</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
