alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4800.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="USB0_EP1">
			<name>USB0_EP2</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x50040940</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0400</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_EP1">
			<name>USB0_EP3</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x50040960</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0400</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_EP1">
			<name>USB0_EP4</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x50040980</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0400</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_EP1">
			<name>USB0_EP5</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x500409A0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0400</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_EP1">
			<name>USB0_EP6</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x500409C0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0400</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>USB0_CH0</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<headerStructName>USB_CH</headerStructName>
			<baseAddress>0x50040500</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>HCCHAR</name>
					<description>Host Channel Characteristics Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MPS</name>
							<description>Maximum Packet Size</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EPNum</name>
							<description>Endpoint Number</description>
							<lsb>11</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EPDir</name>
							<description>Endpoint Direction</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>OUT</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>IN</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPType</name>
							<description>Endpoint Type</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Control</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Isochronous</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Bulk</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Interrupt</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MC_EC</name>
							<description>Multi Count / Error Count</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value2</name>
									<description>1 transaction</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>2 transactions to be issued for this endpoint per frame</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>3 transactions to be issued for this endpoint per frame</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DevAddr</name>
							<description>Device Address</description>
							<lsb>22</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OddFrm</name>
							<description>Odd Frame</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Even frame</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Odd frame</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ChDis</name>
							<description>Channel Disable</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ChEna</name>
							<description>Channel Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Scatter/Gather mode enabled: Indicates that the descriptor structure is not yet ready. Scatter/Gather mode disabled: Channel disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Scatter/Gather mode enabled: Indicates that the descriptor structure and data buffer with data is setup and this channel can access the descriptor. Scatter/Gather mode disabled: Channel enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HCINT</name>
					<description>Host Channel Interrupt Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XferCompl</name>
							<description>Transfer Completed</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ChHltd</name>
							<description>Channel Halted</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AHBErr</name>
							<description>AHB Error</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STALL</name>
							<description>STALL Response Received Interrupt</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NAK</name>
							<description>NAK Response Received Interrupt</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ACK</name>
							<description>ACK Response Received/Transmitted Interrupt</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NYET</name>
							<description>NYET Response Received Interrupt</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>XactErr</name>
							<description>Transaction Error</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BblErr</name>
							<description>Babble Error</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FrmOvrun</name>
							<description>Frame Overrun</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DataTglErr</name>
							<description>Data Toggle Error</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BNAIntr</name>
							<description>BNA (Buffer Not Available) Interrupt</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>XCS_XACT_ERR</name>
							<description>Excessive Transaction Error</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DESC_LST_ROLLIntr</name>
							<description>Descriptor rollover interrupt</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HCINTMSK</name>
					<description>Host Channel Interrupt Mask Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XferComplMsk</name>
							<description>Transfer Completed Mask</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ChHltdMsk</name>
							<description>Channel Halted Mask</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AHBErrMsk</name>
							<description>AHB Error Mask</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>StallMsk</name>
							<description>STALL Response Received Interrupt Mask</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NakMsk</name>
							<description>NAK Response Received Interrupt Mask</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AckMsk</name>
							<description>ACK Response Received/Transmitted Interrupt Mask</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NyetMsk</name>
							<description>NYET Response Received Interrupt Mask</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>XactErrMsk</name>
							<description>Transaction Error Mask</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BblErrMsk</name>
							<description>Babble Error Mask</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FrmOvrunMsk</name>
							<description>Frame Overrun Mask</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DataTglErrMsk</name>
							<description>Data Toggle Error Mask</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BNAIntrMsk</name>
							<description>BNA (Buffer Not Available) Interrupt mask register</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DESC_LST_ROLLIntrMsk</name>
							<description>Descriptor rollover interrupt Mask register</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HCTSIZ_BUFFERMODE</name>
					<description>Host Channel Transfer Size Register [BUFFERMODE]</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XferSize</name>
							<description>Transfer Size</description>
							<lsb>0</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PktCnt</name>
							<description>Packet Count</description>
							<lsb>19</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Pid</name>
							<description>PID</description>
							<lsb>29</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>DATA0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>DATA2</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>DATA1</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>MDATA (non-control)/SETUP (control)</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HCTSIZ_SCATGATHER</name>
					<description>Host Channel Transfer Size Register [SCATGATHER]</description>
					<alternateRegister>HCTSIZ_BUFFERMODE</alternateRegister>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SCHED_INFO</name>
							<description>Schedule information</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NTD</name>
							<description>Number of Transfer Descriptors: 0=1 descriptor, 63=64 descriptors, 1=2 descriptors, 3=4 descriptors, 7=8 descriptors, 15=16 descriptors, 31=32 descriptors, 63=64 descriptors, </description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Pid</name>
							<description>PID</description>
							<lsb>29</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>DATA0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>DATA2</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>DATA1</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>MDATA (non-control)</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HCDMA_BUFFERMODE</name>
					<description>Host Channel DMA Address Register [BUFFERMODE]</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DMAAddr</name>
							<description>DMA Address</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HCDMA_SCATGATHER</name>
					<description>Host Channel DMA Address Register [SCATGATHER]</description>
					<alternateRegister>HCDMA_BUFFERMODE</alternateRegister>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>CTD</name>
							<description>Current Transfer Desc:</description>
							<lsb>3</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 descriptor</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>64 descriptors</description>
									<value>63</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMAAddr</name>
							<description>DMA Address</description>
							<lsb>9</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HCDMAB</name>
					<description>Host Channel DMA Buffer Address Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>Buffer_Address</name>
							<description>Buffer Address</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
