alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4800.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="USB0_CH0">
			<name>USB0_CH1</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x50040520</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_CH0">
			<name>USB0_CH2</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x50040540</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_CH0">
			<name>USB0_CH3</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x50040560</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_CH0">
			<name>USB0_CH4</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x50040580</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_CH0">
			<name>USB0_CH5</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x500405A0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_CH0">
			<name>USB0_CH6</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x500405C0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_CH0">
			<name>USB0_CH7</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x500405E0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_CH0">
			<name>USB0_CH8</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x50040600</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_CH0">
			<name>USB0_CH9</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x50040620</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_CH0">
			<name>USB0_CH10</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x50040640</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_CH0">
			<name>USB0_CH11</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x50040660</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_CH0">
			<name>USB0_CH12</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x50040680</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="USB0_CH0">
			<name>USB0_CH13</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x500406A0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>USIC0</name>
			<description>Universal Serial Interface Controller 0</description>
			<groupName>USIC</groupName>
			<headerStructName>USIC</headerStructName>
			<baseAddress>0x40030008</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>4</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USIC0_0</name>
				<description>Universal Serial Interface Channel (Module 0)</description>
				<value>84</value>
			</interrupt>
			<interrupt>
				<name>USIC0_1</name>
				<description>Universal Serial Interface Channel (Module 0)</description>
				<value>85</value>
			</interrupt>
			<interrupt>
				<name>USIC0_2</name>
				<description>Universal Serial Interface Channel (Module 0)</description>
				<value>86</value>
			</interrupt>
			<interrupt>
				<name>USIC0_3</name>
				<description>Universal Serial Interface Channel (Module 0)</description>
				<value>87</value>
			</interrupt>
			<interrupt>
				<name>USIC0_4</name>
				<description>Universal Serial Interface Channel (Module 0)</description>
				<value>88</value>
			</interrupt>
			<interrupt>
				<name>USIC0_5</name>
				<description>Universal Serial Interface Channel (Module 0)</description>
				<value>89</value>
			</interrupt>
			<registers>
				<register>
					<name>ID</name>
					<description>Module Identification Register</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>0x00AAC000</resetValue>
					<resetMask>0xFFFFFF00</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
