alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4800.svd
					<register>
						<name>MOCTR</name>
						<description>Message Object Control Register</description>
						<addressOffset>0x1C</addressOffset>
						<size>32</size>
						<resetValue>0x00000000</resetValue>
						<resetMask>0x0000FFFF</resetMask>
						<fields>
							<field>
								<name>RESRXPND</name>
								<description>Reset/Set Receive Pending</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SETRXPND</name>
								<description>Reset/Set Receive Pending</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RESTXPND</name>
								<description>Reset/Set Transmit Pending</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SETTXPND</name>
								<description>Reset/Set Transmit Pending</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RESRXUPD</name>
								<description>Reset/Set Receive Updating</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SETRXUPD</name>
								<description>Reset/Set Receive Updating</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RESNEWDAT</name>
								<description>Reset/Set New Data</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SETNEWDAT</name>
								<description>Reset/Set New Data</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RESMSGLST</name>
								<description>Reset/Set Message Lost</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SETMSGLST</name>
								<description>Reset/Set Message Lost</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RESMSGVAL</name>
								<description>Reset/Set Message Valid</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SETMSGVAL</name>
								<description>Reset/Set Message Valid</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RESRTSEL</name>
								<description>Reset/Set Receive/Transmit Selected</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SETRTSEL</name>
								<description>Reset/Set Receive/Transmit Selected</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RESRXEN</name>
								<description>Reset/Set Receive Enable</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SETRXEN</name>
								<description>Reset/Set Receive Enable</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RESTXRQ</name>
								<description>Reset/Set Transmit Request</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SETTXRQ</name>
								<description>Reset/Set Transmit Request</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RESTXEN0</name>
								<description>Reset/Set Transmit Enable 0</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SETTXEN0</name>
								<description>Reset/Set Transmit Enable 0</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RESTXEN1</name>
								<description>Reset/Set Transmit Enable 1</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SETTXEN1</name>
								<description>Reset/Set Transmit Enable 1</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RESDIR</name>
								<description>Reset/Set Message Direction</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SETDIR</name>
								<description>Reset/Set Message Direction</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MOSTAT</name>
						<description>Message Object Status Register</description>
						<alternateRegister>MOCTR</alternateRegister>
						<addressOffset>0x1C</addressOffset>
						<size>32</size>
						<resetValue>0x00000000</resetValue>
						<resetMask>0x0000FFFF</resetMask>
						<fields>
							<field>
								<name>RXPND</name>
								<description>Receive Pending</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>value1</name>
										<description>No CAN message has been received.</description>
										<value>#0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>value2</name>
										<description>A CAN message has been received by the message object n, either directly or via gateway copy action.</description>
										<value>#1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>TXPND</name>
								<description>Transmit Pending</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>value1</name>
										<description>No CAN message has been transmitted.</description>
										<value>#0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>value2</name>
										<description>A CAN message from message object n has been transmitted successfully over the CAN bus.</description>
										<value>#1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>RXUPD</name>
								<description>Receive Updating</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>value1</name>
										<description>No receive update ongoing.</description>
										<value>#0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>value2</name>
										<description>Message identifier, DLC, and data of the message object are currently updated.</description>
										<value>#1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>NEWDAT</name>
								<description>New Data</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>value1</name>
										<description>No update of the message object n since last flag reset.</description>
										<value>#0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>value2</name>
										<description>Message object n has been updated.</description>
										<value>#1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>MSGLST</name>
								<description>Message Lost</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>value1</name>
										<description>No CAN message is lost.</description>
										<value>#0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>value2</name>
										<description>A CAN message is lost because NEWDAT has become set again when it has already been set.</description>
										<value>#1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>MSGVAL</name>
								<description>Message Valid</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>value1</name>
										<description>Message object n is not valid.</description>
										<value>#0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>value2</name>
										<description>Message object n is valid.</description>
										<value>#1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>RTSEL</name>
								<description>Receive/Transmit Selected</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>value1</name>
										<description>Message object n is not selected for receive or transmit operation.</description>
										<value>#0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>value2</name>
										<description>Message object n is selected for receive or transmit operation.</description>
										<value>#1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>RXEN</name>
								<description>Receive Enable</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>value1</name>
										<description>Message object n is not enabled for frame reception.</description>
										<value>#0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>value2</name>
										<description>Message object n is enabled for frame reception.</description>
										<value>#1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>TXRQ</name>
								<description>Transmit Request</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>value1</name>
										<description>No transmission of message object n is requested.</description>
										<value>#0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>value2</name>
										<description>Transmission of message object n on the CAN bus is requested.</description>
										<value>#1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>TXEN0</name>
								<description>Transmit Enable 0</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>value1</name>
										<description>Message object n is not enabled for frame transmission.</description>
										<value>#0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>value2</name>
										<description>Message object n is enabled for frame transmission.</description>
										<value>#1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>TXEN1</name>
								<description>Transmit Enable 1</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>value1</name>
										<description>Message object n is not enabled for frame transmission.</description>
										<value>#0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>value2</name>
										<description>Message object n is enabled for frame transmission.</description>
										<value>#1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>DIR</name>
								<description>Message Direction</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>value1</name>
										<description>Receive Object selected: With TXRQ = 1, a Remote Frame with the identifier of message object n is scheduled for transmission. On reception of a Data Frame with matching identifier, the message is stored in message object n.</description>
										<value>#0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>value2</name>
										<description>Transmit Object selected: If TXRQ = 1, message object n is scheduled for transmission of a Data Frame. On reception of a Remote Frame with matching identifier, bit TXRQ is set.</description>
										<value>#1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>LIST</name>
								<description>List Allocation</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>PPREV</name>
								<description>Pointer to Previous Message Object</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>PNEXT</name>
								<description>Pointer to Next Message Object</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
