alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4800.svd
				<register>
					<dim>16</dim>
					<dimIncrement>4</dimIncrement>
					<name>RCR[%s]</name>
					<description>Result Control Register</description>
					<addressOffset>0x0280</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Standard data reduction (accumulation)</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Result filtering mode</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Difference mode</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Overwrite mode</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wait-for-read mode enabled for this register</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable</description>
							<lsb>25</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Separate result register</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Part of a FIFO structure: copy each new valid result</description>
									<value>#01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No service request</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Service request after a result event</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>4</dimIncrement>
					<name>RES[%s]</name>
					<description>Result Register</description>
					<addressOffset>0x0300</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number</description>
							<lsb>20</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting</description>
							<lsb>25</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Request source 0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request source 1</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Request source 2</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FCR</name>
							<description>Fast Compare Result</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Signal level was below compare value</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal level was above compare value</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No new result available</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Bitfield RESULT has been updated with new result value and has not yet been read, or bit FCR has been updated</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>4</dimIncrement>
					<name>RESD[%s]</name>
					<description>Result Register, Debug</description>
					<addressOffset>0x0380</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number</description>
							<lsb>20</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting</description>
							<lsb>25</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Request source 0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request source 1</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Request source 2</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FCR</name>
							<description>Fast Compare Result</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Signal level was below compare value</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal level was above compare value</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No new result available</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Bitfield RESULT has been updated with new result value and has not yet been read, or bit FCR has been updated</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
