alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4800.svd
				<register>
					<name>DAC1CFG1</name>
					<description>DAC1 Configuration Register 1</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SCALE</name>
							<description>Scale value for up- or downscale of the DAC1 input data in steps by the power of 2 (=shift operation)</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no shift = multiplication/division by 1</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>shift by 1 = multiplication/division by 2</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>shift by 2 = multiplication/division by 4</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>shift left by 3 = multiplication/division by 8</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>shift left by 4 = multiplication/division by 16</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>shift left by 5 = multiplication/division by 32</description>
									<value>#101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>shift left by 6 = multiplication/division by 64</description>
									<value>#110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>shift left by 7 = multiplication/division by 128</description>
									<value>#111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MULDIV</name>
							<description>Switch between up- and downscale of the DAC1 input data values</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>downscale = division (shift SCALE positions to the right)</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>upscale = multiplication (shift SCALE positions to the left)</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OFFS</name>
							<description>8-bit offset value addition</description>
							<lsb>4</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TRIGSEL</name>
							<description>Selects one of the eight external trigger sources for DAC1</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWTRIG</name>
							<description>Software Trigger</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TRIGMOD</name>
							<description>Select the trigger source for channel 1</description>
							<lsb>17</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>internal Trigger (integer divided clock - see FREQ parameter)</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>external Trigger (preselected trigger by TRIGSEL parameter)</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>software Trigger (see SWTRIG parameter)</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ANACFG</name>
							<description>DAC1 analog configuration/calibration parameters</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ANAEN</name>
							<description>Enable analog DAC for channel 1</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>DAC1 is set to standby (analog output only)</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable DAC1 (analog output only)</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REFCFGH</name>
							<description>Higher 4 band-gap configuration/calibration parameters</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC0DATA</name>
					<description>DAC0 Data Register</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA0</name>
							<description>DAC0 Data Bits</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC1DATA</name>
					<description>DAC1 Data Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA1</name>
							<description>DAC1 Data Bits</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC01DATA</name>
					<description>DAC01 Data Register</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA0</name>
							<description>DAC0 Data Bits</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA1</name>
							<description>DAC1 Data Bits</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC0PATL</name>
					<description>DAC0 Lower Pattern Register</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<resetValue>0x3568B0C0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PAT0</name>
							<description>Pattern Number 0 for PATGEN of DAC0</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT1</name>
							<description>Pattern Number 1 for PATGEN of DAC0</description>
							<lsb>5</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT2</name>
							<description>Pattern Number 2 for PATGEN of DAC0</description>
							<lsb>10</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT3</name>
							<description>Pattern Number 3 for PATGEN of DAC0</description>
							<lsb>15</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT4</name>
							<description>Pattern Number 4 for PATGEN of DAC0</description>
							<lsb>20</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT5</name>
							<description>Pattern Number 5 for PATGEN of DAC0</description>
							<lsb>25</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC0PATH</name>
					<description>DAC0 Higher Pattern Register</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<resetValue>0x00007FDD</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PAT6</name>
							<description>Pattern Number 6 for PATGEN of DAC0</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT7</name>
							<description>Pattern Number 7 for PATGEN of DAC0</description>
							<lsb>5</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT8</name>
							<description>Pattern Number 8 for PATGEN of DAC0</description>
							<lsb>10</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC1PATL</name>
					<description>DAC1 Lower Pattern Register</description>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<resetValue>0x3568B0C0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PAT0</name>
							<description>Pattern Number 0 for PATGEN of DAC1</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT1</name>
							<description>Pattern Number 1 for PATGEN of DAC1</description>
							<lsb>5</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT2</name>
							<description>Pattern Number 2 for PATGEN of DAC1</description>
							<lsb>10</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT3</name>
							<description>Pattern Number 3 for PATGEN of DAC1</description>
							<lsb>15</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT4</name>
							<description>Pattern Number 4 for PATGEN of DAC1</description>
							<lsb>20</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT5</name>
							<description>Pattern Number 5 for PATGEN of DAC1</description>
							<lsb>25</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC1PATH</name>
					<description>DAC1 Higher Pattern Register</description>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<resetValue>0x00007FDD</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PAT6</name>
							<description>Pattern Number 6 for PATGEN of DAC1</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT7</name>
							<description>Pattern Number 7 for PATGEN of DAC1</description>
							<lsb>5</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT8</name>
							<description>Pattern Number 8 for PATGEN of DAC1</description>
							<lsb>10</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
