alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4800.svd
				<register>
					<name>GCST</name>
					<description>Global Channel Status</description>
					<addressOffset>0x0018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>S0SS</name>
							<description>Slice 0 shadow transfer status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S0DSS</name>
							<description>Slice 0 Dither shadow transfer status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Dither shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Dither shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S0PSS</name>
							<description>Slice 0 Prescaler shadow transfer status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Prescaler shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Prescaler shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S1SS</name>
							<description>Slice 1 shadow transfer status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S1DSS</name>
							<description>Slice 1 Dither shadow transfer status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Dither shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Dither shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S1PSS</name>
							<description>Slice 1 Prescaler shadow transfer status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Prescaler shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Prescaler shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S2SS</name>
							<description>Slice 2 shadow transfer status</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S2DSS</name>
							<description>Slice 2 Dither shadow transfer status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Dither shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Dither shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S2PSS</name>
							<description>Slice 2 Prescaler shadow transfer status</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Prescaler shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Prescaler shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S3SS</name>
							<description>Slice 3 shadow transfer status</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S3DSS</name>
							<description>Slice 3 Dither shadow transfer status</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Dither shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Dither shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S3PSS</name>
							<description>Slice 3 Prescaler shadow transfer status</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Prescaler shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Prescaler shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CC40ST</name>
							<description>Slice 0 status bit</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CC41ST</name>
							<description>Slice 1 status bit</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CC42ST</name>
							<description>Slice 2 status bit</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CC43ST</name>
							<description>Slice 3 status bit</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MIDR</name>
					<description>Module Identification</description>
					<addressOffset>0x0080</addressOffset>
					<size>32</size>
					<resetValue>0x00A6C000</resetValue>
					<resetMask>0xFFFFFF00</resetMask>
					<fields>
						<field>
							<name>MODR</name>
							<description>Module Revision</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODT</name>
							<description>Module Type</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODN</name>
							<description>Module Number</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
