alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4800.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="CCU40">
			<name>CCU41</name>
			<description>Capture Compare Unit 4 - Unit 1</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x40010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CCU41_0</name>
				<description>Capture Compare Unit 4 (Module 1)</description>
				<value>48</value>
			</interrupt>
			<interrupt>
				<name>CCU41_1</name>
				<description>Capture Compare Unit 4 (Module 1)</description>
				<value>49</value>
			</interrupt>
			<interrupt>
				<name>CCU41_2</name>
				<description>Capture Compare Unit 4 (Module 1)</description>
				<value>50</value>
			</interrupt>
			<interrupt>
				<name>CCU41_3</name>
				<description>Capture Compare Unit 4 (Module 1)</description>
				<value>51</value>
			</interrupt>
		</peripheral>
		<peripheral derivedFrom="CCU40">
			<name>CCU42</name>
			<description>Capture Compare Unit 4 - Unit 2</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x40014000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CCU42_0</name>
				<description>Capture Compare Unit 4 (Module 2)</description>
				<value>52</value>
			</interrupt>
			<interrupt>
				<name>CCU42_1</name>
				<description>Capture Compare Unit 4 (Module 2)</description>
				<value>53</value>
			</interrupt>
			<interrupt>
				<name>CCU42_2</name>
				<description>Capture Compare Unit 4 (Module 2)</description>
				<value>54</value>
			</interrupt>
			<interrupt>
				<name>CCU42_3</name>
				<description>Capture Compare Unit 4 (Module 2)</description>
				<value>55</value>
			</interrupt>
		</peripheral>
		<peripheral derivedFrom="CCU40">
			<name>CCU43</name>
			<description>Capture Compare Unit 4 - Unit 3</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x48004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CCU43_0</name>
				<description>Capture Compare Unit 4 (Module 3)</description>
				<value>56</value>
			</interrupt>
			<interrupt>
				<name>CCU43_1</name>
				<description>Capture Compare Unit 4 (Module 3)</description>
				<value>57</value>
			</interrupt>
			<interrupt>
				<name>CCU43_2</name>
				<description>Capture Compare Unit 4 (Module 3)</description>
				<value>58</value>
			</interrupt>
			<interrupt>
				<name>CCU43_3</name>
				<description>Capture Compare Unit 4 (Module 3)</description>
				<value>59</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>CCU40_CC40</name>
			<description>Capture Compare Unit 4 - Unit 0</description>
			<groupName>CCU4</groupName>
			<headerStructName>CCU4_CC4</headerStructName>
			<baseAddress>0x4000C100</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>INS</name>
					<description>Input Selector Configuration</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EV0IS</name>
							<description>Event 0 signal selection</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU4x.INyA</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU4x.INyB</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>CCU4x.INyC</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>CCU4x.INyD</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>CCU4x.INyE</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>CCU4x.INyF</description>
									<value>#0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>CCU4x.INyG</description>
									<value>#0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>CCU4x.INyH</description>
									<value>#0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>CCU4x.INyI</description>
									<value>#1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>CCU4x.INyJ</description>
									<value>#1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>CCU4x.INyK</description>
									<value>#1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>CCU4x.INyL</description>
									<value>#1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>CCU4x.INyM</description>
									<value>#1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>CCU4x.INyN</description>
									<value>#1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>CCU4x.INyO</description>
									<value>#1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>CCU4x.INyP</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EV1IS</name>
							<description>Event 1 signal selection</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU4x.INyA</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU4x.INyB</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>CCU4x.INyC</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>CCU4x.INyD</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>CCU4x.INyE</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>CCU4x.INyF</description>
									<value>#0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>CCU4x.INyG</description>
									<value>#0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>CCU4x.INyH</description>
									<value>#0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>CCU4x.INyI</description>
									<value>#1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>CCU4x.INyJ</description>
									<value>#1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>CCU4x.INyK</description>
									<value>#1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>CCU4x.INyL</description>
									<value>#1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>CCU4x.INyM</description>
									<value>#1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>CCU4x.INyN</description>
									<value>#1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>CCU4x.INyO</description>
									<value>#1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>CCU4x.INyP</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EV2IS</name>
							<description>Event 2 signal selection</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU4x.INyA</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU4x.INyB</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>CCU4x.INyC</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>CCU4x.INyD</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>CCU4x.INyE</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>CCU4x.INyF</description>
									<value>#0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>CCU4x.INyG</description>
									<value>#0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>CCU4x.INyH</description>
									<value>#0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>CCU4x.INyI</description>
									<value>#1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>CCU4x.INyJ</description>
									<value>#1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>CCU4x.INyK</description>
									<value>#1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>CCU4x.INyL</description>
									<value>#1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>CCU4x.INyM</description>
									<value>#1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>CCU4x.INyN</description>
									<value>#1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>CCU4x.INyO</description>
									<value>#1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>CCU4x.INyP</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EV0EM</name>
							<description>Event 0 Edge Selection</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal active on rising edge</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Signal active on falling edge</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Signal active on both edges</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EV1EM</name>
							<description>Event 1 Edge Selection</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal active on rising edge</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Signal active on falling edge</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Signal active on both edges</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EV2EM</name>
							<description>Event 2 Edge Selection</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal active on rising edge</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Signal active on falling edge</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Signal active on both edges</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EV0LM</name>
							<description>Event 0 Level Selection</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Active on HIGH level</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active on LOW level</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EV1LM</name>
							<description>Event 1 Level Selection</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Active on HIGH level</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active on LOW level</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EV2LM</name>
							<description>Event 2 Level Selection</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Active on HIGH level</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active on LOW level</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LPF0M</name>
							<description>Event 0 Low Pass Filter Configuration</description>
							<lsb>25</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>LPF is disabled</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>3 clock cycles of fCCU4</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>5 clock cycles of fCCU4</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>7 clock cycles of fCCU4</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LPF1M</name>
							<description>Event 1 Low Pass Filter Configuration</description>
							<lsb>27</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>LPF is disabled</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>3 clock cycles of fCCU4</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>5 clock cycles of fCCU4</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>7 clock cycles of fCCU4</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LPF2M</name>
							<description>Event 2 Low Pass Filter Configuration</description>
							<lsb>29</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>LPF is disabled</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>3 clock cycles of fCCU4</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>5 clock cycles of fCCU4</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>7 clock cycles of fCCU4</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
