alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4800.svd
				<register>
					<name>GCSC</name>
					<description>Global Channel Clear</description>
					<addressOffset>0x0014</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>S0SC</name>
							<description>Slice 0 shadow transfer request clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S0DSC</name>
							<description>Slice 0 Dither shadow transfer clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S0PSC</name>
							<description>Slice 0 Prescaler shadow transfer clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S1SC</name>
							<description>Slice 1 shadow transfer clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S1DSC</name>
							<description>Slice 1 Dither shadow transfer clear</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S1PSC</name>
							<description>Slice 1 Prescaler shadow transfer clear</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S2SC</name>
							<description>Slice 2 shadow transfer clear</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S2DSC</name>
							<description>Slice 2 Dither shadow transfer clear</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S2PSC</name>
							<description>Slice 2 Prescaler shadow transfer clear</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S3SC</name>
							<description>Slice 3 shadow transfer clear</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S3DSC</name>
							<description>Slice 3 Dither shadow transfer clear</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S3PSC</name>
							<description>Slice 3 Prescaler shadow transfer clear</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S0ST1C</name>
							<description>Slice 0 status bit 1 clear</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S1ST1C</name>
							<description>Slice 1 status bit 1 clear</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S2ST1C</name>
							<description>Slice 2 status bit 1 clear</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S3ST1C</name>
							<description>Slice 3 status bit 1 clear</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S0ST2C</name>
							<description>Slice 0 status bit 2 clear</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S1ST2C</name>
							<description>Slice 1 status bit 2 clear</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S2ST2C</name>
							<description>Slice 2 status bit 2 clear</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S3ST2C</name>
							<description>Slice 3 status bit 2 clear</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GCST</name>
					<description>Global Channel status</description>
					<addressOffset>0x0018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>S0SS</name>
							<description>Slice 0 shadow transfer status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S0DSS</name>
							<description>Slice 0 Dither shadow transfer status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Dither shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Dither shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S0PSS</name>
							<description>Slice 0 Prescaler shadow transfer status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Prescaler shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Prescaler shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S1SS</name>
							<description>Slice 1 shadow transfer status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S1DSS</name>
							<description>Slice 1 Dither shadow transfer status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Dither shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Dither shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S1PSS</name>
							<description>Slice 1 Prescaler shadow transfer status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Prescaler shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Prescaler shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S2SS</name>
							<description>Slice 2 shadow transfer status</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S2DSS</name>
							<description>Slice 2 Dither shadow transfer status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Dither shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Dither shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S2PSS</name>
							<description>Slice 2 Prescaler shadow transfer status</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Prescaler shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Prescaler shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S3SS</name>
							<description>Slice 3 shadow transfer status</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S3DSS</name>
							<description>Slice 3 Dither shadow transfer status</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Dither shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Dither shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S3PSS</name>
							<description>Slice 3 Prescaler shadow transfer status</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Prescaler shadow transfer has not been requested</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Prescaler shadow transfer has been requested</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CC80ST1</name>
							<description>Slice 0 compare channel 1 status bit</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CC81ST1</name>
							<description>Slice 1 compare channel 1 status bit</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CC82ST1</name>
							<description>Slice 2 compare channel 1 status bit</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CC83ST1</name>
							<description>Slice 3 compare channel 1 status bit</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CC80ST2</name>
							<description>Slice 0 compare channel 2 status bit</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CC81ST2</name>
							<description>Slice 1 compare channel 2 status bit</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CC82ST2</name>
							<description>Slice 2 compare channel 2 status bit</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CC83ST2</name>
							<description>Slice 3 compare channel 2 status bit</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPCHK</name>
					<description>Parity Checker Configuration</description>
					<addressOffset>0x001C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PASE</name>
							<description>Parity Checker Automatic start/stop</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PACS</name>
							<description>Parity Checker Automatic start/stop selector</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CC80</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CC81</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>CC82</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>CC83</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PISEL</name>
							<description>Driver Input signal selector</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CC8x.GP01 - driver output is connected to event 1 of slice 0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CC8x.GP11 - drive output is connected to event 1 of slice 1</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>CC8x.GP21 - driver output is connected to event 1 of slice 2</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>CC8x.GP31 - driver output is connected to event 1 of slice 3</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCDS</name>
							<description>Parity Checker Delay Input Selector</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU8x.IGBTA</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU8x.IGBTB</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>CCU8x.IGBTC</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>CCU8x.IGBTD</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCTS</name>
							<description>Parity Checker type selector</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Even parity enabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Odd parity enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCST</name>
							<description>Parity Checker XOR status</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PCSEL0</name>
							<description>Parity Checker Slice 0 output selection</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PCSEL1</name>
							<description>Parity Checker Slice 1 output selection</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PCSEL2</name>
							<description>Parity Checker Slice 2 output selection</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PCSEL3</name>
							<description>Parity Checker Slice 3 output selection</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MIDR</name>
					<description>Module Identification</description>
					<addressOffset>0x0080</addressOffset>
					<size>32</size>
					<resetValue>0x00A7C000</resetValue>
					<resetMask>0xFFFFFF00</resetMask>
					<fields>
						<field>
							<name>MODR</name>
							<description>Module Revision</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODT</name>
							<description>Module Type</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODN</name>
							<description>Module Number</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
