alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4800.svd
				<register>
					<name>IOCR12</name>
					<description>Port 3 Input/Output Control Register 12</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PC12</name>
							<description>Port Control for Port n Pin 12 to 15</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input - No internal pull device active</description>
									<value>#00000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input - Internal pull-down device active</description>
									<value>#00001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input - Internal pull-up device active</description>
									<value>#00010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input - No internal pull device, Pn_OUTx = input value</description>
									<value>#00011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Input inverted - No internal pull device active</description>
									<value>#00100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Input inverted - Internal pull-down device active</description>
									<value>#00101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Input inverted - Internal pull-up device active</description>
									<value>#00110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Input inverted - No internal pull device, Pn_OUTx = input value</description>
									<value>#00111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Output Push-Pull - General-purpose output</description>
									<value>#10000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>Output Push-Pull - Alternate output function 1</description>
									<value>#10001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>Output Push-Pull - Alternate output function 2</description>
									<value>#10010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>Output Push-Pull - Alternate output function 3</description>
									<value>#10011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>Output Push-Pull - Alternate output function 4</description>
									<value>#10100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>Output Open Drain - General-purpose output</description>
									<value>#11000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>Output Open Drain - Alternate output function 1</description>
									<value>#11001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>Output Open Drain - Alternate output function 2</description>
									<value>#11010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value17</name>
									<description>Output Open Drain - Alternate output function 3</description>
									<value>#11011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value18</name>
									<description>Output Open Drain - Alternate output function 4</description>
									<value>#11100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PC13</name>
							<description>Port Control for Port n Pin 12 to 15</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input - No internal pull device active</description>
									<value>#00000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input - Internal pull-down device active</description>
									<value>#00001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input - Internal pull-up device active</description>
									<value>#00010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input - No internal pull device, Pn_OUTx = input value</description>
									<value>#00011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Input inverted - No internal pull device active</description>
									<value>#00100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Input inverted - Internal pull-down device active</description>
									<value>#00101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Input inverted - Internal pull-up device active</description>
									<value>#00110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Input inverted - No internal pull device, Pn_OUTx = input value</description>
									<value>#00111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Output Push-Pull - General-purpose output</description>
									<value>#10000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>Output Push-Pull - Alternate output function 1</description>
									<value>#10001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>Output Push-Pull - Alternate output function 2</description>
									<value>#10010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>Output Push-Pull - Alternate output function 3</description>
									<value>#10011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>Output Push-Pull - Alternate output function 4</description>
									<value>#10100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>Output Open Drain - General-purpose output</description>
									<value>#11000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>Output Open Drain - Alternate output function 1</description>
									<value>#11001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>Output Open Drain - Alternate output function 2</description>
									<value>#11010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value17</name>
									<description>Output Open Drain - Alternate output function 3</description>
									<value>#11011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value18</name>
									<description>Output Open Drain - Alternate output function 4</description>
									<value>#11100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PC14</name>
							<description>Port Control for Port n Pin 12 to 15</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input - No internal pull device active</description>
									<value>#00000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input - Internal pull-down device active</description>
									<value>#00001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input - Internal pull-up device active</description>
									<value>#00010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input - No internal pull device, Pn_OUTx = input value</description>
									<value>#00011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Input inverted - No internal pull device active</description>
									<value>#00100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Input inverted - Internal pull-down device active</description>
									<value>#00101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Input inverted - Internal pull-up device active</description>
									<value>#00110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Input inverted - No internal pull device, Pn_OUTx = input value</description>
									<value>#00111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Output Push-Pull - General-purpose output</description>
									<value>#10000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>Output Push-Pull - Alternate output function 1</description>
									<value>#10001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>Output Push-Pull - Alternate output function 2</description>
									<value>#10010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>Output Push-Pull - Alternate output function 3</description>
									<value>#10011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>Output Push-Pull - Alternate output function 4</description>
									<value>#10100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>Output Open Drain - General-purpose output</description>
									<value>#11000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>Output Open Drain - Alternate output function 1</description>
									<value>#11001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>Output Open Drain - Alternate output function 2</description>
									<value>#11010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value17</name>
									<description>Output Open Drain - Alternate output function 3</description>
									<value>#11011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value18</name>
									<description>Output Open Drain - Alternate output function 4</description>
									<value>#11100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PC15</name>
							<description>Port Control for Port n Pin 12 to 15</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input - No internal pull device active</description>
									<value>#00000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input - Internal pull-down device active</description>
									<value>#00001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input - Internal pull-up device active</description>
									<value>#00010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input - No internal pull device, Pn_OUTx = input value</description>
									<value>#00011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Input inverted - No internal pull device active</description>
									<value>#00100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Input inverted - Internal pull-down device active</description>
									<value>#00101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Input inverted - Internal pull-up device active</description>
									<value>#00110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Input inverted - No internal pull device, Pn_OUTx = input value</description>
									<value>#00111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Output Push-Pull - General-purpose output</description>
									<value>#10000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>Output Push-Pull - Alternate output function 1</description>
									<value>#10001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>Output Push-Pull - Alternate output function 2</description>
									<value>#10010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>Output Push-Pull - Alternate output function 3</description>
									<value>#10011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>Output Push-Pull - Alternate output function 4</description>
									<value>#10100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>Output Open Drain - General-purpose output</description>
									<value>#11000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>Output Open Drain - Alternate output function 1</description>
									<value>#11001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>Output Open Drain - Alternate output function 2</description>
									<value>#11010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value17</name>
									<description>Output Open Drain - Alternate output function 3</description>
									<value>#11011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value18</name>
									<description>Output Open Drain - Alternate output function 4</description>
									<value>#11100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
