alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4800.svd
				<register>
					<name>IN</name>
					<description>Port 6 Input Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFF0000</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Port n Input Bit 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1</name>
							<description>Port n Input Bit 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2</name>
							<description>Port n Input Bit 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P3</name>
							<description>Port n Input Bit 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P4</name>
							<description>Port n Input Bit 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P5</name>
							<description>Port n Input Bit 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P6</name>
							<description>Port n Input Bit 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P7</name>
							<description>Port n Input Bit 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P8</name>
							<description>Port n Input Bit 8</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P9</name>
							<description>Port n Input Bit 9</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P10</name>
							<description>Port n Input Bit 10</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P11</name>
							<description>Port n Input Bit 11</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P12</name>
							<description>Port n Input Bit 12</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P13</name>
							<description>Port n Input Bit 13</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P14</name>
							<description>Port n Input Bit 14</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P15</name>
							<description>Port n Input Bit 15</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of Pn.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of Pn.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PDR0</name>
					<description>Port 6 Pad Driver Mode 0 Register</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<resetValue>0x22222222</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PD0</name>
							<description>Pad Driver Mode for Pn.0</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>sd_she</name>
									<description>A2 strong driver, sharp edge</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_mee</name>
									<description>A2 strong driver, medium edge</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_soe</name>
									<description>A2 strong driver, soft edge</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>md</name>
									<description>A2 medium driver</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wd</name>
									<description>A2 weak driver</description>
									<value>#111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD1</name>
							<description>Pad Driver Mode for Pn.1</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>sd_she</name>
									<description>A2 strong driver, sharp edge</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_mee</name>
									<description>A2 strong driver, medium edge</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_soe</name>
									<description>A2 strong driver, soft edge</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>md</name>
									<description>A2 medium driver</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wd</name>
									<description>A2 weak driver</description>
									<value>#111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD2</name>
							<description>Pad Driver Mode for Pn.2</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>sd_she</name>
									<description>A2 strong driver, sharp edge</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_mee</name>
									<description>A2 strong driver, medium edge</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_soe</name>
									<description>A2 strong driver, soft edge</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>md</name>
									<description>A2 medium driver</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wd</name>
									<description>A2 weak driver</description>
									<value>#111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD3</name>
							<description>Pad Driver Mode for Pn.3</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>sd_soe</name>
									<description>A1+ strong driver, soft edge</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_sle</name>
									<description>A1+ strong driver, slow edge</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>md</name>
									<description>A1+ medium driver</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wd</name>
									<description>A1+ weak driver</description>
									<value>#111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_soe_alt</name>
									<description>A1+ strong driver, soft edge (alternate value)</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_sle_alt</name>
									<description>A1+ strong driver, slow edge (alternate value)</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>md_alt</name>
									<description>A1+ medium driver (alternate value)</description>
									<value>#110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wd_alt</name>
									<description>A1+ weak driver (alternate value)</description>
									<value>#101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD4</name>
							<description>Pad Driver Mode for Pn.4</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>sd_she</name>
									<description>A2 strong driver, sharp edge</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_mee</name>
									<description>A2 strong driver, medium edge</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_soe</name>
									<description>A2 strong driver, soft edge</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>md</name>
									<description>A2 medium driver</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wd</name>
									<description>A2 weak driver</description>
									<value>#111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD5</name>
							<description>Pad Driver Mode for Pn.5</description>
							<lsb>20</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>sd_she</name>
									<description>A2 strong driver, sharp edge</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_mee</name>
									<description>A2 strong driver, medium edge</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_soe</name>
									<description>A2 strong driver, soft edge</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>md</name>
									<description>A2 medium driver</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wd</name>
									<description>A2 weak driver</description>
									<value>#111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD6</name>
							<description>Pad Driver Mode for Pn.6</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>sd_she</name>
									<description>A2 strong driver, sharp edge</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_mee</name>
									<description>A2 strong driver, medium edge</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_soe</name>
									<description>A2 strong driver, soft edge</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>md</name>
									<description>A2 medium driver</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wd</name>
									<description>A2 weak driver</description>
									<value>#111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD7</name>
							<description>Pad Driver Mode for Pn.7</description>
							<lsb>28</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>sd_she</name>
									<description>A2 strong driver, sharp edge</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_mee</name>
									<description>A2 strong driver, medium edge</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sd_soe</name>
									<description>A2 strong driver, soft edge</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>md</name>
									<description>A2 medium driver</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wd</name>
									<description>A2 weak driver</description>
									<value>#111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
